set_property PACKAGE_PIN W10 [get_ports pdm_out_l]
set_property PACKAGE_PIN AA11 [get_ports pdm_out_r]

set_property IOSTANDARD LVCMOS33 [get_ports pdm_out_*]
set_property DRIVE 16 [get_ports pdm_out_*]
set_property SLEW SLOW [get_ports pdm_out_*]
set_false_path -to [get_ports pdm_out_*]

set_property IOSTANDARD LVCMOS33 [get_ports s_i2s_*]
set_property PACKAGE_PIN Y12 [get_ports s_i2s_sck]
set_property PACKAGE_PIN AG13 [get_ports s_i2s_ws]
set_property PACKAGE_PIN AA12 [get_ports s_i2s_sd]
set_max_delay 80.0 -datapath_only -from [get_ports s_i2s_*]

set_property IOSTANDARD LVDS [get_ports clk_200M_*]
set_property PACKAGE_PIN L3 [get_ports clk_200M_p]
set_property PACKAGE_PIN L2 [get_ports clk_200M_n]
set_property DIFF_TERM_ADV TERM_100 [get_ports clk_200M_*]
create_clock -period 5.000 -name clk_200M [get_ports clk_200M_p]

set_property PACKAGE_PIN AH6 [get_ports data_act_led]
set_property IOSTANDARD LVCMOS18 [get_ports data_act_led]
set_property PACKAGE_PIN AB5 [get_ports fifo_empty]
set_property PACKAGE_PIN AE4 [get_ports fifo_full]
set_property IOSTANDARD LVCMOS18 [get_ports fifo_empty]
set_property IOSTANDARD LVCMOS18 [get_ports fifo_full]
set_false_path -to [get_ports data_act_led]
set_false_path -to [get_ports fifo_empty]
set_false_path -to [get_ports fifo_full]
